Revit 2027 API
IRevisionsOnSheetUIServer Methods
The IRevisionsOnSheetUIServer type exposes the following members.
Methods
Name | Description
GetDescription |  Implement this method to return a description of the server.
(Inherited from IExternalServer)
GetName |  Implement this method to return the name of the server.
(Inherited from IExternalServer)
GetServerId |  Implement this method to return the id of the server.
(Inherited from IExternalServer)
GetServiceId |  Implement this method to return the id of the service.
(Inherited from IExternalServer)
GetVendorId |  Implement this method to return the id of the vendor of the server.
(Inherited from IExternalServer)
ShowDialog | Obsolete.
 Shows dialog on managing RevisionsOnSheetUI.
Top
See Also
Reference
IRevisionsOnSheetUIServer Interface
Autodesk.Revit.UI Namespace